app/controllers/user/map_controller.rb

	def show
		@map = Map.find(params[:id])
---
SELECT "maps".* FROM "maps" WHERE "maps"."id" = $1 LIMIT 1  [["id", "2"]]

	def edit
		@map = Map.find(params[:id])
---
SELECT "maps".* FROM "maps" WHERE "maps"."id" = $1 LIMIT 1  [["id", "3"]]

	def update
		@map = Map.find(params[:id])
		@map.update_attributes!(params[:map])
---
SELECT "maps".* FROM "maps" WHERE "maps"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "maps" SET "name" = 'ghf', "updated_at" = '2013-02-17 17:47:42.247889' WHERE "maps"."id" = 17

	def create
		@map = Map.new(params[:map])
		@map.save!
---
INSERT INTO "maps" ("created_at", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 17 Feb 2013 16:40:14 UTC +00:00], ["name", nil], ["updated_at", Sun, 17 Feb 2013 16:40:14 UTC +00:00], ["user_id", nil]]

	def destroy
		@map = Map.find(params[:id]).destroy
---
DELETE FROM "maps" WHERE "maps"."id" = $1  [["id", 4]]
SELECT "maps".* FROM "maps" WHERE "maps"."id" = $1 LIMIT 1  [["id", "4"]]