app/controllers/user/map_controller.rb

SELECT "maps".* FROM "maps" WHERE "maps"."user_id" = 2
---
	def index
		@maps  = Map.all