app/controllers/home_controller.rb

SELECT "items".* FROM "items"
SELECT "maps".* FROM "maps"
---
	def index
		@items = Item.all
		@maps = Map.all